In [3]:

import pandas as pd
list=['mango','orange','apple','guava']
df=pd.DataFrame(list)
df

        0
0   mango
1  orange
2   apple
3   guava

In [4]:
data={'Name':['soumya','shahid','nitish','kalpana'], 'Age':[20,19,18,20]}
df=pd.DataFrame(data)
df

      Name  Age
0   soumya   20
1   shahid   19
2   nitish   18
3  kalpana   20

In [5]:

data1={'Name':['soumya','shahid','nitish','kalpana'
], 'Age':[20,19,18,20], 'Address':['hariwon','kalaiya','biratnagar','malangwa'], 'Qualification':['B.Tech','B.Tech','B.Tech','B.Tech']}
df=pd.DataFrame(data1)
df

      Name  Age     Address Qualification
0   soumya   20     hariwon        B.Tech
1   shahid   19     kalaiya        B.Tech
2   nitish   18  biratnagar        B.Tech
3  kalpana   20    malangwa        B.Tech

In [6]:

import pandas as pd
import numpy as np
dict={'First Score':[100,90,np.nan,95],
      'Second Score':[34,53,43,np.nan],
      'Third Score':[np.nan,54,64,76]}
df=pd.DataFrame(dict)
df.isnull
df

   First Score  Second Score  Third Score
0        100.0          34.0          NaN
1         90.0          53.0         54.0
2          NaN          43.0         64.0
3         95.0           NaN         76.0

In [7]:
dict1={'First Score':[100,90,np.nan,95],
      'Second Score':[34,53,43,np.nan],
      'Third Score':[np.nan,54,64,76]}
df=pd.DataFrame(dict1)
df.fillna(0.0)
df

   First Score  Second Score  Third Score
0        100.0          34.0          NaN
1         90.0          53.0         54.0
2          NaN          43.0         64.0
3         95.0           NaN         76.0

In [8]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':['jaisurya','ram','rajib','Ansh'],
        'degree': ["BTECH", "CSIT", "M.Tech", "MBA"],
        'score':[95, 48, 88, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      jaisurya
degree       BTECH
score           95
Name: 0, dtype: object

1 name       ram
degree    CSIT
score       48
Name: 1, dtype: object

2 name       rajib
degree    M.Tech
score         88
Name: 2, dtype: object

3 name      Ansh
degree     MBA
score       98
Name: 3, dtype: object

In [9]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
dict = {'name':['jaisurya','ram','rajib','Ansh'],
        'degree': ["BTECH", "CSIT", "M.Tech", "MBA"],
        'score':[95, 48, 88, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

       name  degree  score
0  jaisurya   BTECH     95
1       ram    CSIT     48
2     rajib  M.Tech     88
3      Ansh     MBA     98